var allItems = loadAllItems();
var PromotionInfo = loadPromotions();

function printReceipt(inputs) {

}








// 1. loadAllItems()获取全部的商品，返回结果为对象数组（样例）：
//    [ item1, item2, item3, ..., itemN ]

// 2. 商品对象的结构如下（样例）：{
//       barcode: 'ITEM000000',
//       name: '可口可乐',
//       unit: '瓶',
//       price: 3.00
//    }

// 3. loadPromotions()获取全部的促销信息，返回结果为对象数组（样例）：[
//       {
//         type: 'BUY_TWO_GET_ONE_FREE',
//         barcodes: [
//           'ITEM000000',
//           'ITEM000001'
//         ]
//       },
//     ]
// inputs = [
//   'ITEM000001',
//   'ITEM000001',
//   'ITEM000001',
//   'ITEM000001',
//   'ITEM000001',
//   'ITEM000003-2',
//   'ITEM000005',
//   'ITEM000005',
//   'ITEM000005'
// ];

// '***<没钱赚商店>收据***\n' +
// '名称：雪碧，数量：5瓶，单价：3.00(元)，小计：12.00(元)\n' +
// '名称：荔枝，数量：2斤，单价：15.00(元)，小计：30.00(元)\n' +
// '名称：方便面，数量：3袋，单价：4.50(元)，小计：9.00(元)\n' +
// '----------------------\n' +
// '挥泪赠送商品：\n' +
// '名称：雪碧，数量：1瓶\n' +
// '名称：方便面，数量：1袋\n' +
// '----------------------\n' +
// '总计：51.00(元)\n' +
// '节省：7.50(元)\n' +
// '**********************';
